Tekla Open API Reference for Tekla Structures 2025
BoltItem Class
 The BoltItem class contains information about the bolts in the Tekla Structures bolt catalog.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.BoltItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class BoltItem
<SerializableAttribute>
Public Class BoltItem
The BoltItem type exposes the following members.
Constructors
Name | Description
BoltItem
 Creates a new bolt item instance.
Top
Properties
Name | Description
Lengths
 The bolt item's length values.
Size
 The bolt item's size.
Standard
 The bolt item's grade.
Type
 The bolt item's type.
Top
Methods
Name | Description
ExportBoltStandard
 Exports the bolt item standard + needed bolt catalog items in *.bass-format to the to given file name. If path is not given bolt standard + items are exported to model folder. If filename is empty bolt standard name is used as filename.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace